def prime_checker(p):
    # Перевіряє, чи введене число є простим або ні
    if p < 1:
        return -1
    elif p > 1:
        if p == 2:
            return 1
        for i in range(2, p):
            if p % i == 0:
                return -1
        return 1  # Виправлено відступ, щоб цей оператор був поза циклом

def primitive_check(g, p, L):
    # Перевіряє, чи введене число є первісним коренем чи ні
    for i in range(1, p):
        L.append(pow(g, i) % p)
    for i in range(1, p):
        if L.count(i) > 1:
            L.clear()
            return -1
    return 1  # Виправлено відступ, щоб цей оператор був поза циклом

# Список для зберігання проміжних результатів для перевірки первісності
l = []

while 1:
    P = int(input("Введіть P: "))
    if prime_checker(P) == -1:
        print("Число не є простим, будь ласка, введіть ще раз!")
        continue
    break

while 1:
    G = int(input(f"Введіть первісний корінь для {P}: "))
    if primitive_check(G, P, l) == -1:
        print(f"Число не є первісним коренем для {P}, спробуйте ще раз!")
        continue
    break

# Приватні ключі
x1, x2 = int(input("Введіть приватний ключ користувача 1: ")), int(
    input("Введіть приватний ключ користувача 2: "))
while 1:
    if x1 >= P or x2 >= P:
        print(f"Приватні ключі обох користувачів повинні бути менше, ніж {P}!")
        continue
    break

# Обчислити відкриті ключі
y1, y2 = pow(G, x1) % P, pow(G, x2) % P

# Генерувати секретні ключі
k1, k2 = pow(y2, x1) % P, pow(y1, x2) % P

print(f"\nСекретний ключ для користувача 1: {k1}\nСекретний ключ для користувача 2: {k2}\n")

if k1 == k2:
    print("Ключі успішно обміняні")
else:
    print("Ключі не були обміняні успішно")


#Ця програма реалізує протокол обміну ключами Діффі-Геллмана для створення спільного секретного ключа між двома користувачами. Вона включає функції для перевірки, чи число є простим, та чи є інше число первісним коренем. Користувачі вводять просте число P та його первісний корінь G, а також приватні ключі обох сторін. Програма обчислює відкриті та секретні ключі, а потім перевіряє успішність обміну ключами.